## Instalando as bibliotecas necessárias
- Pandas
- sqlalchemy
- drive pymysql: Esse não tem no nosso ambiente, precisamos instalar

In [1]:
import pandas as pd
import sqlalchemy

In [2]:
!pip install pymysql

Requirement already satisfied: pymysql in c:\users\kawa\anaconda3\lib\site-packages (1.0.2)

### Engine de Conexão ao BD MySQL

Sintaxe:

engine = sqlalchemy.create_engine('mysql+drive://usuario:senha@ip-servidor:porta/banco-de-dados')

**Source:** https://docs.sqlalchemy.org/en/14/core/engines.html

In [3]:
# Criando string de conexão
engine = sqlalchemy.create_engine('mysql+pymysql://lkawaguchi:Kawa211287.@localhost:3306/employees')

## Método: read_sql_table
- Lendo a base de dados

pd.read_sql_table(
    table_name,
    con,
    schema=None,
    index_col=None,
    coerce_float=True,
    parse_dates=None,
    columns=None,
    chunksize: Union[int, NoneType] = None,
)

**con:** engine configurada

In [4]:
# Lendo a tabela employees e tranformando em DataFrame
df = pd.read_sql_table('employees',engine)

In [5]:
df.head()

   emp_no birth_date first_name last_name gender  hire_date
0   10001 1953-09-02     Georgi   Facello      M 1986-06-26
1   10002 1964-06-02    Bezalel    Simmel      F 1985-11-21
2   10003 1959-12-03      Parto   Bamford      M 1986-08-28
3   10004 1954-05-01  Chirstian   Koblick      M 1986-12-01
4   10005 1955-01-21    Kyoichi  Maliniak      M 1989-09-12

In [6]:
# pegando só as colunas específicas
df = pd.read_sql_table('employees',engine,columns=['first_name','last_name'])

In [7]:
df.head()

  first_name last_name
0     Georgi   Facello
1    Bezalel    Simmel
2      Parto   Bamford
3  Chirstian   Koblick
4    Kyoichi  Maliniak

## Consultando direto do banco de dados 

## Método: read_sql_query

pd.read_sql_query(
    sql,
    con,
    index_col=None,
    coerce_float=True,
    params=None,
    parse_dates=None,
    chunksize: Union[int, NoneType] = None,
)

In [8]:
# Criando um dataframe a partir de uma query
df = pd.read_sql_query('select * from employees', engine)

In [9]:
df.head()

   emp_no  birth_date first_name last_name gender   hire_date
0   10001  1953-09-02     Georgi   Facello      M  1986-06-26
1   10002  1964-06-02    Bezalel    Simmel      F  1985-11-21
2   10003  1959-12-03      Parto   Bamford      M  1986-08-28
3   10004  1954-05-01  Chirstian   Koblick      M  1986-12-01
4   10005  1955-01-21    Kyoichi  Maliniak      M  1989-09-12

In [10]:
# Criando query com várias tabelas
query = '''
SELECT emp.first_name,
       emp.last_name,
       emp.gender,
       depar.dept_name as departament_name,
       dept.from_date,
       dept.to_date
FROM employees emp
INNER JOIN dept_emp dept
ON emp.emp_no = dept.emp_no
INNER JOIN departments depar
ON dept.dept_no = depar.dept_no;
'''

In [11]:
df = pd.read_sql_query(query,engine)

In [12]:
df.head()

  first_name    last_name gender  departament_name   from_date     to_date
0       Mary        Sluis      F  Customer Service  1990-01-22  1996-11-09
1       Huan        Lortz      M  Customer Service  1989-09-20  9999-01-01
2      Basil       Tramer      F  Customer Service  1992-05-04  9999-01-01
3   Breannda  Billingsley      M  Customer Service  1992-11-11  9999-01-01
4   Jungsoon     Syrzycki      F  Customer Service  1992-03-21  9999-01-01

In [13]:
# Criando um dataframe a partir de uma query usaando parametros dinâmicos
query = 'SELECT first_name, last_name ' \
    'FROM employees ' \
    'WHERE first_name = %s'

In [14]:
df = pd.read_sql_query(query,engine,params=['Mary'])

In [15]:
df.head()

  first_name last_name
0       Mary     Sluis
1       Mary   Wossner
2       Mary    Piazza
3       Mary      Ertl
4       Mary    Cooley

In [16]:
# Criando um dataframe a partir de uma query usaando parametros NOMEADOS
query = '''
SELECT emp.first_name,
       emp.last_name,
       emp.gender,
       depar.dept_name as departament_name,
       dept.from_date,
       dept.to_date
FROM employees emp
INNER JOIN dept_emp dept
ON emp.emp_no = dept.emp_no
INNER JOIN departments depar
ON dept.dept_no = depar.dept_no
WHERE dept.from_date >= %(data_inicial)s AND to_date < %(data_final)s
'''

In [17]:
df = pd.read_sql_query(query, engine, params={'data_inicial':'1990-01-22', 'data_final':'1996-11-09'})

In [18]:
df.head()

  first_name last_name gender  departament_name   from_date     to_date
0      Genta    Kolvik      M  Customer Service  1993-03-31  1994-10-23
1    Willard     Rosin      F  Customer Service  1995-04-25  1996-03-29
2       Maik   Ushiama      M  Customer Service  1992-06-09  1993-02-10
3      Danco    Etalle      M  Customer Service  1993-07-03  1993-09-19
4      Marco  DasSarma      M  Customer Service  1990-02-27  1996-03-20

In [19]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 16201 entries, 0 to 16200
Data columns (total 6 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   first_name        16201 non-null  object
 1   last_name         16201 non-null  object
 2   gender            16201 non-null  object
 3   departament_name  16201 non-null  object
 4   from_date         16201 non-null  object
 5   to_date           16201 non-null  object
dtypes: object(6)
memory usage: 759.5+ KB

## Método: read_sql

uma junção do **read_sql_query** e o **read_sql_table**, vai identificar de forma automática.

In [20]:
# Criando DataFrame passando apenas o nome da tabela
df = pd.read_sql('departments', engine)

In [21]:
df.head()

  dept_no         dept_name
0    d009  Customer Service
1    d005       Development
2    d002           Finance
3    d003   Human Resources
4    d001         Marketing

In [22]:
df = pd.read_sql('select dept_name from departments', engine)

In [23]:
df.head()

          dept_name
0  Customer Service
1       Development
2           Finance
3   Human Resources
4         Marketing

In [24]:
df = pd.read_sql('select * from departments where dept_name = %s', engine, params=['Finance'])

In [25]:
df.head()

  dept_no dept_name
0    d002   Finance

In [26]:
df = pd.read_sql('select * from departments where dept_name in (%(nome1)s,%(nome2)s)', engine,
                 params={'nome1':'Finance', 'nome2':'Marketing'})

In [27]:
df.head()

  dept_no  dept_name
0    d002    Finance
1    d001  Marketing

## Método: to_sql

Enviando o Dataframe para o banco de dados relacional

In [28]:
arquivo = 'Arquivos/automobile.csv'

In [29]:
words = ['symboling', 'normalized-losses','make','fuel-type','aspiration']
df = pd.read_csv(arquivo,sep=',',header=None, usecols=[0,1,2,3,4], names=words)

In [30]:
df.head()

   symboling normalized-losses         make fuel-type aspiration
0          3                 ?  alfa-romero       gas        std
1          3                 ?  alfa-romero       gas        std
2          1                 ?  alfa-romero       gas        std
3          2               164         audi       gas        std
4          2               164         audi       gas        std

### Conhecendo os parâmetros do método to_sql

- **name** = Nome da tabela que será criada no SGBD.
- **con** = Objeto conexão criado pelo SQLAlchemy.
- **schema** = Nome do Schema onde será criada a tabela.
- **if_exists** = Comportamento caso a tabela exista no SGBD.
    - 'replace' - Substituirá toda a tabela criada
    - 'append' - Adicionará as informações a partir do último registro da tabela.
- **index** = Escreve o índice do DataFrame como uma coluna da tabela.
- **index_label** = Nome da coluna de índice


### Criando a tabela no BD a partir do DataFrame

In [31]:
df.to_sql(
    name = 'tb_automobile',
    con = engine
)

### Criando a tabela no Banco de Dados sem a coluna do índice

In [32]:
# Se não tiver o if_exists, o código dará erro devido a tabela já ter sido criada anteriormente.
df.to_sql(
    name = 'tb_automobile',
    con = engine,
    index = False,
    if_exists = 'replace'
)